Revit 2026 API
FieldValues Constructor
Overload List
Name | Description
FieldValues(FieldValues) |  Creates a copy of the given FieldValues instance.
FieldValues(IList<ValueAtPoint>) | Initializes a new instance of the FieldValues class
FieldValues(IList<VectorAtPoint>) | Initializes a new instance of the FieldValues class
FieldValues(IList<ValueAtPoint>, XYZ) | Initializes a new instance of the FieldValues class
Top
See Also
Reference
FieldValues Class
Autodesk.Revit.DB.Analysis Namespace